import 'package:get/get.dart';
final List<Map<String, dynamic>> categories = [
  {
    'value': 'Мал-жандык',
    'label': 'Мал-жандык',
  },
  {
    'value': 'Авто',
    'label': 'Авто',
  },
  {
    'value': 'Транспорт',
    'label': 'Транспорт',
  },
  {
    'value': 'Аренда',
    'label': 'Аренда',
  },
  {
    'value': 'Кыймылсыз мүлк',
    'label': 'Кыймылсыз мүлк',
  },
  {
    'value': 'Айыл-чарба',
    'label': 'Айыл-чарба',
  },
  {
    'value': 'Электроника',
    'label': 'Электроника',
  },
  {
    'value': 'Кызматтар',
    'label': 'Кызматтар',
  },
  {
    'value': 'Курулуш-материалдар',
    'label': 'Курулуш-материалдар',
  },
  {
    'value': 'Тамак-аш',
    'label': 'Тамак-аш',
  },
  {
    'value': 'Үй-шаймандары',
    'label': 'Үй-шаймандары',
  },
  {
    'value': 'Кайрымдуулук',
    'label': 'Кайрымдуулук',
  },
  {
    'value': 'Окуу-куралдары',
    'label': 'Окуу-куралдары',
  },
  {
    'value': 'Кол өнөрчүлүк',
    'label': 'Кол өнөрчүлүк',
  },
  {
    'value': 'Жумуш',
    'label': 'Жумуш',
  },
  {
    'value': 'Такси',
    'label': 'Такси',
  },
  {
    'value': 'Дары-дармек',
    'label': 'Дары-дармек',
  },
  {
    'value': 'Кийим-кече',
    'label': 'Кийим-кече',
  },
  {
    'value': 'Бизнес',
    'label': 'Бизнес',
  },
];

final List<Map<String, dynamic>> categoriesForAdd = [
  {
    'value': 'Мал-жандык',
    'label': 'Мал-жандык'.tr,
  },
  {
    'value': 'Авто',
    'label': 'Авто'.tr,
  },
  {
    'value': 'Транспорт',
    'label': 'Транспорт'.tr,
  },
  {
    'value': 'Аренда',
    'label': 'Аренда'.tr,
  },
  {
    'value': 'Кыймылсыз мүлк',
    'label': 'Кыймылсыз мүлк'.tr,
  },
  {
    'value': 'Айыл-чарба',
    'label': 'Айыл-чарба'.tr,
  },
  {
    'value': 'Электроника',
    'label': 'Электроника'.tr,
  },
  {
    'value': 'Кызматтар',
    'label': 'Кызматтар'.tr,
  },
  {
    'value': 'Курулуш-материалдар',
    'label': 'Курулуш-материалдар'.tr,
  },
  {
    'value': 'Тамак-аш',
    'label': 'Тамак-аш'.tr,
  },
  {
    'value': 'Үй-шаймандары',
    'label': 'Үй-шаймандары'.tr,
  },
  {
    'value': 'Кайрымдуулук',
    'label': 'Кайрымдуулук'.tr,
  },
  {
    'value': 'Окуу-куралдары',
    'label': 'Окуу-куралдары'.tr,
  },
  {
    'value': 'Кол өнөрчүлүк',
    'label': 'Кол өнөрчүлүк'.tr,
  },
  {
    'value': 'Жумуш',
    'label': 'Жумуш'.tr,
  },
  {
    'value': 'Такси',
    'label': 'Такси'.tr,
  },
  {
    'value': 'Дары-дармек',
    'label': 'Дары-дармек'.tr,
  },
  {
    'value': 'Кийим-кече',
    'label': 'Кийим-кече'.tr,
  },
  {
    'value': 'Бизнес',
    'label': 'Бизнес'.tr,
  },
];
